storage/2018-02-11--18-48-43/2018-02-11--18-48-43-deleteContact-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:xmethods-delayed-quotes" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Body><ns1:addContact><name xsi:type="xsd:string">Pippo</name><email xsi:type="xsd:string">pippo@pippo.it</email><phone_number xsi:type="xsd:string">92392929</phone_number><address xsi:type="xsd:string">Road of the hell</address></ns1:addContact></SOAP-ENV:Body></SOAP-ENV:Envelope>
